{"level": "Level 3", "type": "Counting & Probability", "content": "In a single-elimination tournament, each game is between two players. Only the winner of each game advances to the next round. In a particular such tournament there are 256 players. How many individual games must be played to determine the champion?", "steps": "A total of 255 players must be eliminated to determine the champion, and one player is eliminated after each game, so it is easy to see that $\\boxed{255}$ games must be played.", "answer": "255"}
{"level": "Level 2", "type": "Counting & Probability", "content": "James has 7 apples. 4 of them are red, and 3 of them are green. If he chooses 2 apples at random, what is the probability that both the apples he chooses are green?", "steps": "There are $\\binom{7}{2}=21$ total ways for James to choose 2 apples from 7, but only $\\binom{3}{2}=3$ ways for him to choose 2 green apples. So, the probability that he chooses 2 green apples is $\\frac{3}{21}=\\boxed{\\frac{1}{7}}$.", "answer": "\\frac{1}{7}"}
{"level": "Level 3", "type": "Counting & Probability", "content": "The three-digit positive integer $N$ has a ones digit of 3. What is the probability that $N$ is divisible by 3? Express your answer as a common fraction.", "steps": "Let $N = xy3$, where $x,y$ are digits.  Then $N$ is divisible by 3 if and only if the number $xy$ is.  But since $\\frac{1}{3}$ of the two-digit integers are divisible by 3, our final probability is $\\boxed{\\frac{1}{3}}$.", "answer": "\\frac{1}{3}"}
{"level": "Level 5", "type": "Counting & Probability", "content": "If Greg rolls four fair six-sided dice, what is the probability that he rolls more 1's than 6's?", "steps": "We notice that the probability that he rolls more 1's than 6's must equal the probability that he rolls more 6's than 1's. So, we can find the probability that Greg rolls the same number of 1's and 6's, subtract it from 1, and divide by 2 to find the probability that Greg rolls more 1's than 6's. There are three ways Greg can roll the same number of 1's and 6's: he can roll two of each, one of each, or none of each. If he rolls two of each, there are $\\binom{4}{2}=6$ ways to choose which two dice roll the 1's. If he rolls one of each, there are $\\binom{4}{1}\\binom{3}{1}=12$ ways to choose which dice are the 6 and the 1, and for each of those ways there are $4\\cdot4=16$ ways to choose the values of the other dice. If Greg rolls no 1's or 6's, there are $4^4=256$ possible values for the dice. In total, there are $6+12\\cdot16+256=454$ ways Greg can roll the same number of 1's and 6's. There are $6^4=1296$ total ways the four dice can roll, so the probability that Greg rolls more 1's than 6's is $\\dfrac{1}{2} \\left(1-\\dfrac{454}{1296}\\right)=\\boxed{\\dfrac{421}{1296}}$.", "answer": "\\dfrac{421}{1296}"}
{"level": "Level 1", "type": "Counting & Probability", "content": "Calculate $\\frac{3 \\cdot 5! + 15\\cdot 4!}{6!}$", "steps": "We factor and rearrange the terms in the factorials:\n\n\\begin{align*}\n\\frac{3\\cdot 5! + 15\\cdot 4!}{6!} &= \\frac{3\\cdot 5! + 3\\cdot 5!}{6!} \\\\\n&= \\frac{2\\cdot 3 \\cdot 5!}{6!} \\\\\n&= \\frac{6!}{6!} \\\\\n&= \\boxed{1}\n\\end{align*}", "answer": "1"}
{"level": "Level 5", "type": "Counting & Probability", "content": "If I have a $4\\times 4$ chess board, in how many ways can I place four distinct pawns on the board such that each column and row of the board contains no more than one pawn?", "steps": "Because our chess board is $4 \\times 4$, there must be exactly one pawn in each column and each row. Consider the ways to place one pawn in each row. In the first row, there are four potential spots for a pawn. However, no matter where we place the pawn, it takes up one column. So, in the second row, there are only three potential spots for a pawn. Similarly, there are two spots in the third row and only one in the fourth. Thus, there are $4\\cdot 3 \\cdot 2 \\cdot 1 = 24$ ways in which we can place the pawns. Now, because each pawn is distinct, we have four possible pawns to place in the first slot, three in the second, two in the fourth, and one in the last. So there are $24$ possible orderings of the pawns. Our final answer is thus $24^2 = \\boxed{576}$.", "answer": "576"}
{"level": "Level 5", "type": "Counting & Probability", "content": "Tom has a red marble, a green marble, a blue marble, and three identical yellow marbles. How many different groups of two marbles can Tom choose?", "steps": "There are two cases here: either Tom chooses two yellow marbles (1 result), or he chooses two marbles of different colors ($\\binom{4}{2}=6$ results). The total number of distinct pairs of marbles Tom can choose is $1+6=\\boxed{7}$.", "answer": "7"}
{"level": "Level 5", "type": "Counting & Probability", "content": "If six people decide to come to a basketball game, but three of them are only 2/5 sure that they will stay for the entire time (the other three are sure they'll stay the whole time), what is the probability that at the end, at least 5 people stayed the entire time?", "steps": "There are two cases: 5 people and 6 people stayed.\n\nCase 1: 5 people stayed the whole time.  The probability that exactly 2 of those that are unsure stayed the entire time is $\\binom{3}{2}\\times \\frac{2}{5}\\times\\frac{2}{5}\\times\\frac{3}{5}= 36/125$.\n\nCase 2: 6 people stayed the whole time.  The probability that all three unsure people stayed is $(2/5)^3 = 8/125$.\n\nThe sum of these probabilities is $\\boxed{\\frac{44}{125}}$.", "answer": "\\frac{44}{125}"}
